; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v5 - type_1 ?v4 - type_3)
 	      (pred_2 ?v1 - object ?v4 - type_3)
	      (pred_4 ?v5 - type_1 ?v7 - type_2)
	      (pred_1 ?v5 - type_1 ?v1 - object ?v7 - type_2))

   (:action op_2
       :parameters  (?v5 - type_1 ?v8 ?v6 - type_3)
       :precondition (and  (pred_3 ?v5 ?v8))
       :effect (and  (pred_3 ?v5 ?v6)
		     (not (pred_3 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_1 ?v3 - object ?v2 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v2) (pred_3 ?v5 ?v2) (pred_4 ?v5 ?v7))
       :effect (and (pred_1 ?v5 ?v3 ?v7)
		    (not (pred_2 ?v3 ?v2)) 
		    (not (pred_4 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_1 ?v3 - object ?v2 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v3 ?v7) (pred_3 ?v5 ?v2))
       :effect (and (pred_2 ?v3 ?v2)
		    (pred_4 ?v5 ?v7)
		    (not (pred_1 ?v5 ?v3 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_09 obj_07 - type_2
obj_02 obj_01 obj_04 obj_05 - type_3
obj_10 obj_08 obj_03 - object)
(:init
(pred_3 obj_06 obj_04)
(pred_4 obj_06 obj_09)
(pred_4 obj_06 obj_07)
(pred_2 obj_10 obj_05)
(pred_2 obj_08 obj_01)
(pred_2 obj_03 obj_05)
)
(:goal
(and
(pred_2 obj_10 obj_01)
(pred_2 obj_08 obj_02)
(pred_2 obj_03 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_06 ?b obj_07))))
)
)

; plan
1. (op_2 obj_06 obj_04 obj_01)
   deleted: (pred_3 obj_06 obj_04)
   added: (pred_3 obj_06 obj_01)
   goals met: 1 of 3
2. (op_1 obj_06 obj_08 obj_01 obj_09)
   deleted: (pred_2 obj_08 obj_01) (pred_4 obj_06 obj_09)
   added: (pred_1 obj_06 obj_08 obj_09)
   goals met: 1 of 3
3. (op_2 obj_06 obj_01 obj_02)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_02)
   goals met: 1 of 3
4. (op_3 obj_06 obj_08 obj_02 obj_09)
   deleted: (pred_1 obj_06 obj_08 obj_09)
   added: (pred_2 obj_08 obj_02) (pred_4 obj_06 obj_09)
   goals met: 2 of 3
5. (op_2 obj_06 obj_02 obj_05)
   deleted: (pred_3 obj_06 obj_02)
   added: (pred_3 obj_06 obj_05)
   goals met: 2 of 3
6. (op_1 obj_06 obj_10 obj_05 obj_09)
   deleted: (pred_2 obj_10 obj_05) (pred_4 obj_06 obj_09)
   added: (pred_1 obj_06 obj_10 obj_09)
   goals met: 2 of 3
7. (op_2 obj_06 obj_05 obj_01)
   deleted: (pred_3 obj_06 obj_05)
   added: (pred_3 obj_06 obj_01)
   goals met: 2 of 3
8. (op_3 obj_06 obj_10 obj_01 obj_09)
   deleted: (pred_1 obj_06 obj_10 obj_09)
   added: (pred_2 obj_10 obj_01) (pred_4 obj_06 obj_09)
   goals met: 3 of 3
